# â˜ï¸ CRUD: Create => Read => Update => Delete

ã“ã®ãƒãƒ¼ãƒˆãƒ–ãƒƒã‚¯ã§ã¯ãƒ¬ã‚³ãƒ¼ãƒ‰ã‚’è¿½åŠ ãƒ»æ›´æ–°ãƒ»å‰Šé™¤ã™ã‚‹æ–¹æ³•ã«ã¤ã„ã¦ç¢ºèªã—ã¦ã„ãã¾ã™ã€‚

> CRUDï¼ˆã‚¯ãƒ©ãƒƒãƒ‰ï¼‰ã¨ã¯ã€ã»ã¨ã‚“ã©å…¨ã¦ã®ã‚³ãƒ³ãƒ”ãƒ¥ãƒ¼ã‚¿ã‚½ãƒ•ãƒˆã‚¦ã‚§ã‚¢ãŒæŒã¤æ°¸ç¶šæ€§[1]ã®4ã¤ã®åŸºæœ¬æ©Ÿèƒ½ã®ã‚¤ãƒ‹ã‚·ãƒ£ãƒ«ã‚’ä¸¦ã¹ãŸç”¨èªã€‚ãã®4ã¤ã¨ã¯ã€Createï¼ˆç”Ÿæˆï¼‰ã€Readï¼ˆèª­ã¿å–ã‚Šï¼‰ã€Updateï¼ˆæ›´æ–°ï¼‰ã€Deleteï¼ˆå‰Šé™¤ï¼‰ã§ã‚ã‚‹ã€‚ãƒ¦ãƒ¼ã‚¶ã‚¤ãƒ³ã‚¿ãƒ•ã‚§ãƒ¼ã‚¹ãŒå‚™ãˆã‚‹ã¹ãæ©Ÿèƒ½ï¼ˆæƒ…å ±ã®å‚ç…§/æ¤œç´¢/æ›´æ–°ï¼‰ã‚’æŒ‡ã™ç”¨èªã¨ã—ã¦ã‚‚ä½¿ã‚ã‚Œã‚‹ã€‚
>
> https://ja.wikipedia.org/wiki/CRUD

## 1. åˆæœŸè¨­å®š

Jupyter Notebook ã‚’å†èµ·å‹•ã—ãŸå ´åˆãªã©ã¯ã“ã“ã‹ã‚‰å®Ÿè¡Œã—ã¦ãã ã•ã„

In [ ]:
! pip install ipython-sql pymysql
%load_ext sql

## 2. æ¥ç¶šç¢ºèª

In [2]:
%%sql mysql+pymysql://hello:world@10.0.1.100/employees
select 'hello' as world

1 rows affected.

[('hello',)]

## 3. ä¸€æ™‚ãƒ†ãƒ¼ãƒ–ãƒ«ã®ä½œæˆ

ã“ã®æ¼”ç¿’ã§ä½¿ç”¨ã—ã¦ã„ã‚‹ `hello` ãƒ¦ãƒ¼ã‚¶ãƒ¼ã«ã¯ `employees` ãƒ‡ãƒ¼ã‚¿ãƒ™ãƒ¼ã‚¹ã®èª­ã¿å–ã‚Šæ¨©é™ã®ã»ã‹ä¸€æ™‚çš„ãªãƒ†ãƒ¼ãƒ–ãƒ«ã‚’ä½œæˆã™ã‚‹ã“ã¨ãŒã§ãã‚‹ `tmp` ãƒ‡ãƒ¼ã‚¿ãƒ™ãƒ¼ã‚¹ã¸ã®ã‚¢ã‚¯ã‚»ã‚¹æ¨©é™ã‚’ä»˜ä¸ã—ã¦ã‚ã‚Šã¾ã™ã€‚ã“ã®ãƒãƒ¼ãƒˆãƒ–ãƒƒã‚¯ã§ã¯ `tmp` ãƒ‡ãƒ¼ã‚¿ãƒ™ãƒ¼ã‚¹ã‚’ä½¿ã£ã¦ã€ãƒ‡ãƒ¼ã‚¿ã‚’æ ¼ç´ãƒ»æ›´æ–°ãƒ»å‰Šé™¤ã™ã‚‹ãŸã‚ã®æ–¹æ³•ã‚’ç¢ºèªã—ã¦ã„ãã¾ã™ã€‚

ä»¥ä¸‹ã®ã‚¯ã‚¨ãƒªã‚’å®Ÿè¡Œã™ã‚‹ã“ã¨ã§ä¸€æ™‚çš„ãªãƒ†ãƒ¼ãƒ–ãƒ«ã‚’ä½œæˆã™ã‚‹ã“ã¨ãŒã§ãã¾ã™ã€‚`<ãƒ‡ãƒ¼ã‚¿ãƒ™ãƒ¼ã‚¹å>.<ãƒ†ãƒ¼ãƒ–ãƒ«å>` ã®ã‚ˆã†ã«ãƒ†ãƒ¼ãƒ–ãƒ«åã‚’æŒ‡å®šã™ã‚‹ã“ã¨ã§åˆ¥ã®ãƒ‡ãƒ¼ã‚¿ãƒ™ãƒ¼ã‚¹ã«ã‚ã‚‹ãƒ†ãƒ¼ãƒ–ãƒ«ã‚’æŒ‡å®šã§ãã¾ã™ã€‚

In [3]:
%%sql
create temporary table tmp.hello (
    id int,
    value text
)

 * mysql+pymysql://hello:***@10.0.1.100/employees
0 rows affected.

[]

## 4. ãƒ¬ã‚³ãƒ¼ãƒ‰ã®è¿½åŠ 

INSERT æ–‡ã‚’åˆ©ç”¨ã™ã‚‹ã“ã¨ã§ãƒ†ãƒ¼ãƒ–ãƒ«ã«ãƒ¬ã‚³ãƒ¼ãƒ‰ã‚’è¿½åŠ ã™ã‚‹ã“ã¨ãŒã§ãã¾ã™ã€‚

In [4]:
%%sql
insert into tmp.hello values (10, "item-1"), (20, "item-2");

select * from tmp.hello;

 * mysql+pymysql://hello:***@10.0.1.100/employees
2 rows affected.
2 rows affected.

[(10, 'item-1'), (20, 'item-2')]

## 5. ã‚¯ã‚¨ãƒªã®å®Ÿè¡Œçµæœã‚’å…ƒã«ãƒ†ãƒ¼ãƒ–ãƒ«ã‚’ä½œæˆã™ã‚‹

å¤šãã®ã‚¯ã‚¨ãƒªã‚¨ãƒ³ã‚¸ãƒ³ã«ã¯ãƒ†ãƒ¼ãƒ–ãƒ«ã‚’ä½œæˆã™ã‚‹éš›ã« SELECT æ–‡ã®å®Ÿè¡Œçµæœã‚’ãã®ã¾ã¾æ ¼ç´ã§ãã‚‹ `CREATE TABLE AS` (CTAS) ã¨ã„ã†æ§‹æ–‡ãŒç”¨æ„ã•ã‚Œã¦ã„ã¾ã™ã€‚é›†è¨ˆã«æ™‚é–“ãŒã‹ã‹ã‚‹ã‚ˆã†ãªã‚¯ã‚¨ãƒªã®å®Ÿè¡Œçµæœã‚’ä¿å­˜ã—ãŸã‚Šã€ç•°ãªã‚‹ã‚µãƒ¼ãƒãƒ¼ã«ã‚ã‚‹ãƒ‡ãƒ¼ã‚¿ãƒ™ãƒ¼ã‚¹ã«ã‚ã‚‹ãƒ†ãƒ¼ãƒ–ãƒ«ã‚’ã‚³ãƒ”ãƒ¼ã™ã‚‹ã¨ããªã©ã«ä¾¿åˆ©ãªæ©Ÿèƒ½ã§ã™ã€‚ä»¥ä¸‹ã¯ `employees` ãƒ†ãƒ¼ãƒ–ãƒ«ã‹ã‚‰ `emp_no` ãŒ `10005` æœªæº€ã®ç¤¾å“¡æƒ…å ±ã‚’ `tmp.new_employees` ãƒ†ãƒ¼ãƒ–ãƒ«ã«æ ¼ç´ã™ã‚‹ã‚¯ã‚¨ãƒªã§ã™ã€‚

In [5]:
%%sql
create temporary table tmp.new_employees as
select
    *
from
    employees
where
    emp_no  < 10005
;

select * from tmp.new_employees;

 * mysql+pymysql://hello:***@10.0.1.100/employees
4 rows affected.
4 rows affected.

[(10001, datetime.date(1953, 9, 2), 'Georgi', 'Facello', 'M', datetime.date(1986, 6, 26)),
 (10002, datetime.date(1964, 6, 2), 'Bezalel', 'Simmel', 'F', datetime.date(1985, 11, 21)),
 (10003, datetime.date(1959, 12, 3), 'Parto', 'Bamford', 'M', datetime.date(1986, 8, 28)),
 (10004, datetime.date(1954, 5, 1), 'Chirstian', 'Koblick', 'M', datetime.date(1986, 12, 1))]

`INSERT` æ–‡ã«ã¤ã„ã¦ã‚‚ `SELECT` æ–‡ã®å®Ÿè¡Œçµæœã‚’ãã®ã¾ã¾æŒ¿å…¥ã™ã‚‹ã“ã¨ãŒã§ãã¾ã™ã€‚ä»¥ä¸‹ã¯å…ˆã»ã©ä½œã£ãŸãƒ†ãƒ¼ãƒ–ãƒ«ã« `employees` ã‹ã‚‰ `emp_no` ãŒ `499997` ä»¥ä¸Šã®ãƒ¬ã‚³ãƒ¼ãƒ‰ã‚’è¿½åŠ ã™ã‚‹ã‚¯ã‚¨ãƒªã§ã™ã€‚

In [6]:
%%sql
insert into tmp.new_employees
select * from employees where emp_no >= 499997;

select * from tmp.new_employees;

 * mysql+pymysql://hello:***@10.0.1.100/employees
3 rows affected.
7 rows affected.

[(10001, datetime.date(1953, 9, 2), 'Georgi', 'Facello', 'M', datetime.date(1986, 6, 26)),
 (10002, datetime.date(1964, 6, 2), 'Bezalel', 'Simmel', 'F', datetime.date(1985, 11, 21)),
 (10003, datetime.date(1959, 12, 3), 'Parto', 'Bamford', 'M', datetime.date(1986, 8, 28)),
 (10004, datetime.date(1954, 5, 1), 'Chirstian', 'Koblick', 'M', datetime.date(1986, 12, 1)),
 (499997, datetime.date(1961, 8, 3), 'Berhard', 'Lenart', 'M', datetime.date(1986, 4, 21)),
 (499998, datetime.date(1956, 9, 5), 'Patricia', 'Breugel', 'M', datetime.date(1993, 10, 13)),
 (499999, datetime.date(1958, 5, 1), 'Sachin', 'Tsukuda', 'M', datetime.date(1997, 11, 30))]

## 6. ãƒ¬ã‚³ãƒ¼ãƒ‰ã®æ›´æ–°

`UPDATE` æ–‡ã‚’åˆ©ç”¨ã™ã‚‹ã“ã¨ã§ãƒ¬ã‚³ãƒ¼ãƒ‰ã‚’æ›´æ–°ã™ã‚‹ã“ã¨ãŒã§ãã¾ã™ã€‚

```sql
UPDATE
    <ãƒ†ãƒ¼ãƒ–ãƒ«å>
SET
    <ã‚«ãƒ©ãƒ å> = <æ–°ã—ã„å€¤>
WHERE
    <æ¤œç´¢æ¡ä»¶>
```

ä»¥ä¸‹ã®ã‚¯ã‚¨ãƒªã¯ `tmp.new_employees` ãƒ†ãƒ¼ãƒ–ãƒ«ã«ã¤ã„ã¦ `emp_no` ãŒ `10003` ã§ã‚ã‚‹ç¤¾å“¡ã® `first_name` ã‚’ `Raryosu` ã«å¤‰æ›´ã—ã¾ã™ã€‚

In [7]:
%%sql
update tmp.new_employees set first_name = 'Raryosu' where emp_no = 10003;

select * from tmp.new_employees where emp_no = 10003;

 * mysql+pymysql://hello:***@10.0.1.100/employees
1 rows affected.
1 rows affected.

[(10003, datetime.date(1959, 12, 3), 'Raryosu', 'Bamford', 'M', datetime.date(1986, 8, 28))]

## 7. ãƒ¬ã‚³ãƒ¼ãƒ‰ã®å‰Šé™¤

DELETE æ–‡ã‚’åˆ©ç”¨ã™ã‚‹ã“ã¨ã§ãƒ¬ã‚³ãƒ¼ãƒ‰ã‚’å‰Šé™¤ã™ã‚‹ã“ã¨ãŒã§ãã¾ã™ã€‚

```sql
DELETE FROM
    <ãƒ†ãƒ¼ãƒ–ãƒ«å>
WHERE
    <æ¤œç´¢æ¡ä»¶>
```

ä»¥ä¸‹ã®ã‚¯ã‚¨ãƒªã¯ `tmp.new_employees` ãƒ†ãƒ¼ãƒ–ãƒ«ã«ã¤ã„ã¦ `first_name` ãŒ `Raryosu` ã§ã‚ã‚‹ãƒ¬ã‚³ãƒ¼ãƒ‰ã‚’å‰Šé™¤ã—ã¾ã™ã€‚

In [8]:
%%sql
delete from tmp.new_employees where first_name = 'Raryosu'

 * mysql+pymysql://hello:***@10.0.1.100/employees
1 rows affected.

[]

`emp_no` ãŒ `10003` ã®ãƒ¬ã‚³ãƒ¼ãƒ‰ãŒå‰Šé™¤ã•ã‚Œã¾ã—ãŸã€‚

In [12]:
%%sql
select * from tmp.new_employees;

 * mysql+pymysql://hello:***@10.0.1.100/employees
6 rows affected.

[(10001, datetime.date(1953, 9, 2), 'Georgi', 'Facello', 'M', datetime.date(1986, 6, 26)),
 (10002, datetime.date(1964, 6, 2), 'Bezalel', 'Simmel', 'F', datetime.date(1985, 11, 21)),
 (10004, datetime.date(1954, 5, 1), 'Chirstian', 'Koblick', 'M', datetime.date(1986, 12, 1)),
 (499997, datetime.date(1961, 8, 3), 'Berhard', 'Lenart', 'M', datetime.date(1986, 4, 21)),
 (499998, datetime.date(1956, 9, 5), 'Patricia', 'Breugel', 'M', datetime.date(1993, 10, 13)),
 (499999, datetime.date(1958, 5, 1), 'Sachin', 'Tsukuda', 'M', datetime.date(1997, 11, 30))]

`DELETE` æ–‡ã§æ¤œç´¢æ¡ä»¶ã‚’æŒ‡å®šã—ãªã„å ´åˆã¯å…¨ã¦ã®ãƒ¬ã‚³ãƒ¼ãƒ‰ãŒå‰Šé™¤ã•ã‚Œã¾ã™ã€‚

In [13]:
%%sql
delete from tmp.new_employees;

 * mysql+pymysql://hello:***@10.0.1.100/employees
6 rows affected.

[]

In [14]:
%%sql
select * from tmp.new_employees;

 * mysql+pymysql://hello:***@10.0.1.100/employees
0 rows affected.

[]

`TRUNCATE` æ–‡ã‚’ä½¿ã†ã“ã¨ã§ã‚‚å…¨ã¦ã®ãƒ¬ã‚³ãƒ¼ãƒ‰ã‚’å‰Šé™¤ã™ã‚‹ã“ã¨ãŒã§ãã¾ã™ã€‚

In [17]:
%%sql
truncate tmp.hello;

select * from tmp.hello;

 * mysql+pymysql://hello:***@10.0.1.100/employees
0 rows affected.
0 rows affected.

[]

ãã‚Œãã‚Œã®ä»¥ä¸‹ã®ã‚ˆã†ãªç‰¹å¾´ãŒã‚ã‚Šã¾ã™ã€‚

- `DELETE` æ–‡
    - ãƒˆãƒ©ãƒ³ã‚¶ã‚¯ã‚·ãƒ§ãƒ³ã§ãƒ­ãƒ¼ãƒ«ãƒãƒƒã‚¯ã§ãã‚‹
- `TRUNCATE` æ–‡
    - ãƒ­ãƒ¼ãƒ«ãƒãƒƒã‚¯ã§ããªã„ãŒé«˜é€Ÿï¼ˆãƒ†ãƒ¼ãƒ–ãƒ«ã‚’å†æ§‹ç¯‰ã™ã‚‹ï¼‰

## 8. ãƒ†ãƒ¼ãƒ–ãƒ«ã®å‰Šé™¤

`DROP TABLE` æ–‡ã‚’å®Ÿè¡Œã™ã‚‹ã“ã¨ã§ãƒ†ãƒ¼ãƒ–ãƒ«ã‚’å‰Šé™¤ã§ãã¾ã™ã€‚ä»¥ä¸‹ã¯ `tmp.new_employees` ãƒ†ãƒ¼ãƒ–ãƒ«ã‚’å‰Šé™¤ã™ã‚‹ã‚¯ã‚¨ãƒªã§ã™ã€‚

In [19]:
%%sql
drop table tmp.new_employees;

 * mysql+pymysql://hello:***@10.0.1.100/employees
0 rows affected.

[]

## ğŸŒ± ç·´ç¿’å•é¡Œ

Q. `employees` ãƒ†ãƒ¼ãƒ–ãƒ«ã‚’å…ƒã«ç¤¾å“¡ã®ãƒ•ãƒ«ãƒãƒ¼ãƒ ãŒå…¥ã£ãŸãƒ†ãƒ¼ãƒ–ãƒ« `tmp.emp_full_names` ã‚’ä½œæˆã— `emp_no` ãŒ `219686` ã§ã‚ã‚‹ç¤¾å“¡ã®ãƒ•ãƒ«ãƒãƒ¼ãƒ ã‚’æ¤œç´¢ã§ãã‚‹ã‚ˆã†ã«ã—ã¦ãã ã•ã„ã€‚

`concat` é–¢æ•°ã‚’åˆ©ç”¨ã™ã‚‹ã“ã¨ã§æ–‡å­—åˆ—ã‚’çµåˆã™ã‚‹ã“ã¨ãŒã§ãã¾ã™ã€‚

In [40]:
%%sql
select
    concat('Hello', ', ', 'World') as col

 * mysql+pymysql://hello:***@10.0.1.100/employees
1 rows affected.

[('Hello, World',)]

- `first_name` ã¨ã€€`last_name` ã‚’åŠè§’ã‚¹ãƒšãƒ¼ã‚¹ã§åŒºåˆ‡ã£ãŸæ–‡å­—åˆ—ã‚’ãƒ•ãƒ«ãƒãƒ¼ãƒ ã¨ã™ã‚‹ã‚‚ã®ã¨ã—ã¾ã™
- ãƒ†ãƒ¼ãƒ–ãƒ«å®šç¾©ã«ã¤ã„ã¦ã¯ `emp_no` ã§æ¤œç´¢ã§ãã‚‹ã‚ˆã†ãªå½¢ã«ã—ã¦ãã ã•ã„
- ãƒ•ãƒ«ãƒãƒ¼ãƒ ã‚’è¡¨ã™ã‚«ãƒ©ãƒ ã®åå‰ã¯å•ã„ã¾ã›ã‚“ãŒåˆ†ã‹ã‚Šã‚„ã™ã„ã‚‚ã®ã«æŒ‡å®šã—ã¦ã¿ã¾ã—ã‚‡ã† ğŸ‘

In [ ]:
%%sql
-- 2å›ä»¥ä¸Šå®Ÿè¡Œã™ã‚‹ã¨ãã¯ãƒ†ãƒ¼ãƒ–ãƒ«ã®ä½œæˆã§é‡è¤‡ã‚¨ãƒ©ãƒ¼ãŒå‡ºã‚‹ã®ã§
-- ä¸‹ã®è¡Œã®ã‚³ãƒ¡ãƒ³ãƒˆã‚’è§£é™¤ã—ã¦ DROP TABLE ã‚’å®Ÿè¡Œã™ã‚‹ã‚ˆã†ã«ã—ã¦ãã ã•ã„
-- drop table tmp.emp_full_names;
create temporary table tmp.emp_full_names as

-- Hint: ã“ã®ä¸‹ã« SELECT æ–‡ã‚’è¨˜è¿°ã—ã¦ãã ã•ã„
select
    1 as emp_no
;

-- ä¸‹ã®ã‚¯ã‚¨ãƒªãŒé€šã‚‹ã‚ˆã†ã« tmp.emp_full_names ãƒ†ãƒ¼ãƒ–ãƒ«ã‚’ä½œæˆã—ã¦ã¿ã¾ã—ã‚‡ã†
select
    *
from
    tmp.emp_full_names
where
    emp_no = 219686

ä»¥ä¸‹ã®ã‚³ãƒ¼ãƒ‰ã‚’å®Ÿè¡Œã—ã¦å›ç­”ï¼ˆå¯¾è±¡ç¤¾å“¡ã®ãƒ•ãƒ«ãƒãƒ¼ãƒ ï¼‰ã‚’æå‡ºã—ã¦ãã ã•ã„ã€‚

In [ ]:
# å®Ÿè¡Œå¾Œã€"your answer" ã®å³å´ã«è¡¨ç¤ºã•ã‚Œã‚‹å…¥åŠ›ãƒœãƒƒã‚¯ã‚¹ã«ç­”ãˆã‚’å…¥åŠ›ã— Enter ã‚­ãƒ¼ã‚’æŠ¼ã—ã¦ãã ã•ã„ m(_ _)m
import urllib.request

answer = input('your answer: ')

url = 'http://10.0.1.100:18080/submit'
data = 'q=q201&a={}'.format(answer.strip()).encode('utf-8')
req = urllib.request.Request(url, data=data, method='POST')
with urllib.request.urlopen(req) as res:
    print(res.read().decode('utf-8'))